# 1
# saxelebi = ["ანა", "გიორგი", "ნიკა", "მარიამი", "დავითი"]


# print("პირველი ელემენტი:", saxelebi[0])
# print("ბოლო ელემენტი:", saxelebi[-1])


# 2


# xhili = ["ვაშლი", "მსხალი", "ბანანი", "ფორთოხალი", "საზამთრო"]


# print("ბოლო ელემენტი:", xhili[-1])
# print("ბოლოს წინა ელემენტი:", xhili[-2])



# 3


# saxeli = input("შეიყვანე შენი სახელი: ")


# print("პირველი ასო:", saxeli[0])
# print("ბოლო ასო:", saxeli[-1])



# 4




saxelebi = ["ანა", "გიორგი", "ნიკა", "მარიამი", "დავითი", "თეკლა", "საბა"]


nakadi = saxelebi[1:5]


print("მე-2-დან მე-5-მდე ელემენტები:", nakadi)


# მას არ მაქვს პრობლემა გადმოვალ თქვენსრაზმში ხო სწორეა დავალებები?