# num1 =int(input("first number:"))

# num2 =int(input("second number:"))

# print(num1+num2)
# print(num1-num2)
# print(num1*num2)
# print(num1//num2)
# print(num1/num2)

# საუკეთესო პრაქტიკა საჭიროა რადგან გვესმოდეს როგორ უნდა დავწეროთ კოდი ყველასთვის მარტივ და გასაგებ ენაზე
# ასევე ჩვენთვისაც რომ იყვეს გასაგები
# snake case,ცვკადი რომელიც მარტივად რომ ვთქვათ სფეისის მაგივრად ქვედატირეს იყენებს მაგ.num_zero num_one
# cave sensitive ეს პითოის კოდია და მისი მნიშვნელობა გამოიხატება იმაში თუ იწყება თუ არა დიდი ასოთი ენა ან ბრძანება
# მგონი ცოტა მიჭირს ახსნა ბოდიშით :)