# 1) შექმენით ფუნქცია greet და დააბრუნეთ მისასალმებელი ტექსტი return ის საშუალებით
# 2) შექმენით ფუნქცია add რომელსაც გადაეცემა ორი პარამეტრი num1 და num2 შემდეგ კი დააბრუნეთ მათი ჯამი
# 3) შექმენით ფუნქცია multiplay რომელსაც გადაეცემა ორი რიცხვი შემდეგ კი დააბრუნეთ მათი ნამრავლი
# 4) კომენტარებით ახსენით რაა არის არგუმენტი, რა არის პარამეტრი და რატომ ვიყენებთ ფუნქციებს

# 1.
def greet():
    return "hello"
num1 = greet()
print(num1)

# 2
def add(num1,num2):
    return num1+num2
result = add(2,4)
print(result)

# 3
def multiolay(num1,num2):
    return num1*num2
idk123 = multiolay(3,6)
print(idk123)

# 4
# პარამეტრი არის დროებითი ცვლადი რომელსაც ვიყენებთ ფუნქციის შექმნის დროს
# ფრჩხილებში მოქცეული მნიშვნელობა არის არგუმენტი