# ამ გვერდს ვიყენებ რომ დამატებით გაკვეთილზე ვიმუშავო მასწავლებელთან


# 1.რას არის მონაცემთა ტიპი?
# მონაცემთა ტიპი არის მონაცემის სახეობა, რომელიც განსაზღვრავს
# რა ტიპის მნიშვნელობის შენახვა შეიძლება ცვლადში და
# რა ოპერაციების შესრულებაა შესაძლებელი მასზე.

# # 2.რას ეწოდება კონკადინაცია?
# კონკადინაცია (Concatenation) ეწოდება ორი ან მეტი ტექსტური მონაცემის (სტრინგის) ერთმანეთთან შეერთებას ერთ მთლიან ტექსტად.


# --------------------------------

# რა არის პითონი?
# პითონი არის მაღალი დონის პროგრამირების ენა, რომელიც გამოიყენება პროგრამების, ვებ-საიტების, თამაშების, მონაცემთა ანალიზის და სხვ. შესაქმნელად.
# რისთვის გამოიყენება პროგრამირების ენა პითონი?
# ბექენდის გასაკეთებლად გამოიყენება პითონი და ლოგიკური ოპერაციების გასაკეთებლადასევე გამოიყენება:

# ვებ-ბექენდი

# ხელოვნური ინტელექტი

# მონაცემთა ბაზები

# ალგორითმები
# როგორ იწერება კომენტარი პითონში?
# ძიეზით
# რას აკეთებს print() ფუნქცია?
# გამოაქვს მონაცემი ეკრანზე
# როგორ შევინახოთ რიცხვი ცვლადში? (მაგალითით)
# cvladi = 1
# როგორ შევინახოთ ტექსტი (სტრინგი) ცვლადში?
# cvladi = "teqsti"
# რა მონაცემთა ტიპია 5 ?
# ინტეჯერია
# რა მონაცემთა ტიპია "Hello" ?
# სტრინგი
# რას ნიშნავს = ნიშანი პითონში?
# = ნიშნავს მნიშვნელობის მინიჭებას ცვლადისთვის
# რას გამოიტანს ეს კოდი?
print("Hello World")
# Hello world-ს გამოიტანს






# რა განსხვავებაა int და float მონაცემთა ტიპებს შორის?
# ინეჯერი მთელიან რიცხვებზე გამოიყენება,ფლოათები ათწილად და წილადებზე და სხვა
# რას ნიშნავს input() ფუნქცია?
# ინფუთ ფუნქციით პითონში მომხმარებელს შემოვაყვანინებთ რაიმე ცვლადს,სიტყვისმნიშვნელობას
# რას გამოიტანს ეს კოდი?

# x = 5
# print(x)
# 5

# რას გამოიტანს ეს კოდი?

# a = "Hi"
# b = "Python"
# print(a + b)
# hiPython

# როგორ მივიღოთ მომხმარებლისგან რიცხვი პითონში?
# დავწეროთ user = input("enter smth: ") და მომხმარებელი რიცხვს ჩაწერს
# რას ნიშნავს type() ფუნქცია?
# ვიგებთ ამ ფუნქციით თუ რა ტიპის ცვლადი წერია მასში
# რა იქნება შედეგი?

# print(10 + 5)
# 15

# რა განსხვავებაა "5" და 5 შორის?
# 1.სტრინგია2.ინტეჯერი
# რას გამოიტანს ეს კოდი?

# name = input()
# print("Hello " + name)
# Nameდამერეინფუთშიჩაწერილისიტყვა







# რა გამოიტანს შემდეგი კოდი?

# x = 10
# y = 5
# print(x > y)
# true

# რა ტიპის მონაცემია True ან False?
# ბულიონიარის
# რა გამოიტანს შემდეგი კოდი?

# a = 5
# b = 5
# print(a == b)
# უდრის ნიშნავს ბულიონში

# რას აკეთებს len() ფუნქცია სტრინგზე?
# len() გამოიყენება როცა გვინდა რომ გავიგოთ სიაში რამდენი ელემენტია ან სტრინგში რამდენი ასოა და სხვა
# რა გამოიტანს შემდეგი კოდი?

# name = "Sandro"
# print(len(name))
# 6

# რას ნიშნავს != ოპერატორი?
# არ ტოლობა ბულიონში
# როგორ შევაერთოთ ორი სტრინგი ცვლადში? (მაგალითი)
# + ნიშნით
# რას გამოიტანს შემდეგი კოდი?

# x = "10"
# y = "5"
# print(x + y)
# 105

# რას გამოიტანს შემდეგი კოდი?

# x = 10
# y = 5
# print(x - y)
# 5
# რას გამოიტანს შემდეგი კოდი?
# x = 7
# y = 2
# print(x % y)
# 4.5