# # 1
# for i in range(20):  
#     print("თვენი სახელი და გვარი")  

# # 2
# for i in range(1, 21):
#     print(i)

# # 3
# for i in range(20, -1, -1):
#     print(i)

# 1) გამოიტანეთ რიცხვები 10-დან 15-მდე
# i = 10
# while i <= 15:
#     print(i)
#     i += 1

# 2) გამოიტანეთ რიცხვები 50-დან 0-მდე
# i = 50
# while i >= 0:
#     print(i)
#     i -= 1

# 3) კომენტარი:
# counter ცვლადი არის ცვლადი, რომელიც ითვლის ციკლის გამეორებებს

# 4) 
# i = 10
# while i <= 70:
#     if i % 2 == 0:
#         print(i)
#     i += 1

# # 5) 
# i = 25
# while i <= 55:
#     if i % 2 == 1:
#         print(i)
#     i += 1