# 1)შექმენით სია სადაც გექნებათ რიცხვები მოცემული და 
# ახალ სიაში ჩაამატეთ ისეთი რიცხვები რომლებიც იყოფა 3ზეც და 5 ზეც

list1 = [10, 15, 23, 30, 45, 60, 67, 90, 100]
new_list1 = [num for num in list1 if num % 3 == 0 and num % 5 == 0]
print(new_list1)

# 2)შექმენით სია სადაც გექნებათ მოცემული სახელები, შემდეგ ახალ სიაში
# ჩაამატეთ ისეთი სახელები სახელები რომლის სიმბოლოების რაოდენობაც არის ლუწი რიცხვი
list2 = ["Vano", "Beka", "Giorgi", "Guja", "Tornike", "Luka", "Sandro"]
new_list2 = [name for name in list2 if len(name) % 2 == 0]
print(new_list2)
# 3) ახსენით კომენტარებით რაში გვჭირდება list comprehension
# list compension გამოიუენება კოდის მოკლედ და მარტივად დაწერისთვის ამით
# დროს ვიგებთ და ვამცირებთ კოდების ხაზს ანუ ნაკლებ ხაზს ვიკავებთ