# # for ციკლის გამოყენებით
# for i in range(1, 21):
#     print(i)

# # while ციკლის გამოყენებით
# i = 1
# while i <= 20:
#     print(i)
#     i += 1

# Sequencing ნიშნავს, რომ პროგრამის ინსტრუქციები სრულდება ზედიზედ, თანმიმდევრობით — ერთის შემდეგ მეორე.

# print("გამარჯობა")
# print("როგორ ხარ?")
# print("ნახვამდის")
# მაგალითი~

# Iteration ნიშნავს კოდის ნაწილის განმეორებით შესრულებას, სანამ გარკვეული პირობა შესრულებულია.
# for i in range(4):
#     print("Hello")

# Selection ნიშნავს, რომ პროგრამაში შესაძლებელია სხვადასხვა გზის არჩევა გარკვეული პირობის მიხედვით.

age = 18
if age >= 18:
    print("სრულწლოვანი ხარ")
else:
    print("არ ხარ სრულწლოვანი")