# 2)შექმენით 5 ელემენტიანი Tuple და unpacking ის გამოყენებით თითოეულ ელემენტს მიანიჭეთ შესაბამისი ცვლადი
werbs  = (10, 20, 30, 40, 50)
a, c, x, *m = werbs 

# 3)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება ის list ისგან

# tuple ში იწერება ელემიენტები რომლის გადაკეთება წაშლა არ შეგვიძლია და არც შეცვლა ხოლო ლოსტში ყველაფერი პირიქით

# 4)შექმენით 6 ელემენტიანი tuple და გამოიყენეთ .index() და .count() მეთოდები
idk = (5, 10, 15, 10, 20, 10)

print(idk.index(15))
print(idk.count(10))

# 5) კომენტარებით ახსენით რა არის *rest
# rest გამოიყენება კოლექციაში დარჩენილი მნიშვნელობის გადასაცემად
