# დიქშენარი:

# 1.შექმენი სტუდენტების ქულების დიქშენარი (სახელი → ქულა) და იპოვე რომელი სტუდენტი მიიღო ყველაზე მაღალი ქულა.
# 2.დაწერე პროგრამა, სადაც დიქშენარში შენახულია პროდუქტების ფასები და დათვალე ჯამური ფასი.
# 3.გქონდეს დიქშენარი წიგნების შესახებ (სათაური → ავტორი) და მოძებნე რომელ ავტორს ეკუთვნის კონკრეტული წიგნი.

# 1.

students = {
    "luka": 15,
    "sandro": 30,
    "malxaz": 45
}

best_student = max(students, key=students.get)
print(best_student)

# 2.

products = {
    "apple":2,
    "banana":3,
    "blueberri":1
}

count = sum(products.values())
print(count)

# 3.

serch_books ={
    "ავტორი1":"ნაწარმოები1",
    "ავტორი2":"ნაწარმოები2",
    "ავტორი3":"ნაწარმოები3"
}

serch = input("serch: ")
print(serch_books.get(serch))


# 2.1

# სეტი:
# 1.დაწერე პროგრამა, სადაც მომხმარებელი შეიყვანს რამდენიმე სიტყვას და შენ უნდა შეინახო მხოლოდ უნიკალური სიტყვები სეტში.
# 2.შექმენი სეტი რიცხვებით 1-დან 10-მდე და ამოიღე ყველა ლუწი რიცხვი და ჩასვი სეტში რომელსაც ლისტად გადააქცევთ list ფუნქციის დახმარებით
# 3.გაქვს სია მოსწავლეების ID-ებით. გადააქციე სეტად და შეამოწმე არის თუ არა ორჯერ შემოსული ერთი და იგივე ID~

# 1.

setz = input("enter words: ")
unique_words = set(setz.split())
print(unique_words)

# 2.

nums = {1,2,3,4,5,6,7,8,9,10}
even_nums = {num for num in nums if num % 2 == 0}
print(list(even_nums))