# hw1
# fruits = ["ანანასი","ატამი", "ვაშლი", "ბანანი", "მსხალი","მანგო" ]

# print("პირველი ხილია:", fruits[0])
# print("ბოლო ხილია:", fruits[-1])

# hw2
# fruits = ["ანანასი","ატამი", "ვაშლი", "ბანანი", "მსხალი","მანგო" ]
# print("ბოლო ხილია:", fruits[-1])
# print("ბოლოს წინა ხილია:", fruits[-2])
# too ez ;]

# hw3
# name = input("შეიყვანეთ თქვენი სახელი: ")
# print("თქვენი პირველი ასო:", name[0])
# print("თქვენი ბოლო ასო:", name[-1])
# აი ლაიკ ზეთ ;) ანდ ეზ

# hw4
names = [  "მალხაზა","თეკლა", "გიორგი", "ვახო", "დავით","ანა","ნინო" ]
selected_names = names[1:5+1]

# შედეგის დაბეჭდვა
print("სიის მე-2 დან მე-5 ელემენტამდე სახელებია:", selected_names)