# age = int(input("შეიყვანეთ თქვენი ასაკი: "))
# result = age // 10
# print("რიცხვი 10 მოთავსდება თქვენს ასაკში", result, "ჯერ.")

# my_name = "სანდრო"
# user_name = input("შეიყვანეთ თქვენი სახელი: ")

# if user_name == my_name:
#     print("ჩვენ ერთნაირი სახელი გვაქვს!")
# else:
# #     print("ჩვენ სხვადასხვა სახელი გვაქვს.")
# --ეს დავალება მაგრა მომეწონა მას <3--

# num1 = int(input("შეიყვანეთ პირველი რიცხვი (num1): "))
# num2 = int(input("შეიყვანეთ მეორე რიცხვი (num2): "))

# remainder = num1 % num2
# print("ნაშთი num1 / num2 გაყოფის შემდეგ არის:", remainder, "თუ გინდა კიდევ სცადე")

# asaki = int(input("შეიყვანეთ თქვენი ასაკი: "))

# if asaki % 2 == 0:
#     print("თქვენი ასაკი ლუწია.")
# else:
#     print("თქვენი ასაკი კენტია.")
# მას ეს სწორი არის არ ვიცი ცოტა ვიწვალე და გამიჭირდა