# 1)დაასრულეთ სოლოლერნის პითონის კურსი და აიღეთ სერთიფიკატები
# 2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.
# 3) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" is "მომხმარებლის ასაკი" წლის.
# 4) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს ერთ რიცხვს და საბოლოოდ პასუხად დააბრუნებს ამ რიცხვის კვადრატს.
# (რიცხვის ხარისხში აყვანის ოპერატორია **)

# 1
def idk123(num1,num2,num3):
    return num1+num2+num3
result = idk123(1,2,3)
print(result)

# 2
def info(name,age):
    return name + " " + "არის" + " " + age + " " +"წლის"
result1 = input("შემოიყვანეთ მომხმარებლის სახელი:")
result2 = input("შემოიყვანეთ მომხმარებლის ასაკი:")

print(info(result1,result2))

# 3

def calc(number):
    return number**2
calc_result = calc(5)

print(calc_result)