# 1)შექმენი ცვლადი,მიანიჭეთ ამ ცვლადს შემდეგი სტრინგი --> "ჰიდროელექტროსადგური" თქვენი
#  დავალებაა გამოიტანოთ ამ სიტყვიდან პირველიდან 1 ინდექსიდან
#  მე - 7 ინდექსამდე ელემენტები და ასევე კიდევ გამოიტანეთ ამ
#  სტრინგიდან მე8 ინდექსიდან 16 - ე ინდექსამდე ელემენტები
string = "hidroeleqtrosadguri"
print(string[1:7])
print(string[8:16])

# 2)1)შექმენი ცვლადი რომელსაც გადაეცემა პატარა ასოებით დაწერილი სტრინგი,შენი დავალებაა დააბრუნო ეს სტრინგი ოღონდ uppercase ში გადაყვანილი
#   2)შექმენი ცვლადი რომელსაც გადაეცემა  დიდი ასოებით დაწერილი სტრინგი,შენი დავალებაა დააბრუნო ეს სტრინგი ოღონდ lowercase ში გადაყვანილი
#   3)შექმენი ცვლადი რომელსაც გადაეცემა პატარა ასოებით დაწერილი სტრინგი,შენი დავალებაა დააბრუნო ეს სტრინგი ისე რომ პირველი ასო იყოს დიდი
#   4)შექმენი ცვლადი რომელსაც გადაეცემა სტრინგი --> "კაიპურისჭამა" , შენი დავალებაა ამ სტრინგიდან გაიგო რომელ ინდექსზე დგას ასო "ჭ" და ასო "პ"

# 2)1)
string2 = "hello world"
print(string2.upper())
# 2)2)
print(string2.lower())
# 2)3)
print(string.capitalize())
# 2)4)
string = "კაიპურისჭამა"
print(string.index("ჭ"))
print(string.index("პ"))